{
  "id": "827063432874808180",
  "url": "https://www.airbnb.com/rooms/827063432874808180",
  "title": "Baia 6BR Villa with Green Land View in Ubud",
  "summary": "Villa Baia is a beautifully large and fully equipped, 2 storey villa with 6 bedrooms, a fully equipped gym, billiard pool and fireplace! The villa easily allows for easy access to the outdoor areas without any constraints! Breathe life into your vacation and enjoy the great outdoors while still being fully nestled and comfortable in Villa Baia, perfect for larger groups of friends or larger families.\n\nThe space\nVilla Baia is a luxurious and spacious villa that provides an unforgettable vacation experience for larger groups of friends or families. With its 2-story design, it offers plenty of room for everyone to spread out and relax. The 6 bedrooms are fully equipped with all the necessary amenities, including comfortable beds, high-quality linens, and ample storage space, ensuring that every guest has a restful and rejuvenating stay.\n\nOne of the standout features of Villa Baia is its fully equipped gym, aimed for those who want to keep up with their fitness routine while on vacation. Whether you prefer weightlifting, cardio, or yoga, you'll find everything you need to stay in shape. The gym is fully air-conditioned, ensuring a comfortable workout experience no matter the weather outside.\n\nFor those who prefer leisure activities, Villa Baia has a billiard pool table, perfect for hours of fun and friendly competition. The fireplace provides a warm and cozy atmosphere, perfect for relaxing with a good book or enjoying a glass of wine with friends.\n\nVilla Baia provides easy access to the outdoor areas, allowing guests to breathe life into their vacation and enjoy the great outdoors. Whether you prefer sunbathing by the pool or exploring the local areas, you'll have everything you need right at your fingertips. With its beautiful and peaceful surroundings, Villa Baia is the perfect place to escape from the hustle and bustle of everyday life and fully relax and recharge.\n\nThe location of Villa Baia makes it an ideal choice for those who want to immerse themselves in the local culture and experience the natural beauty of the area. With its close proximity to the famous rice terraces, guests can easily explore this iconic attraction and take in the breathtaking views. Whether you are an art lover, nature enthusiast,\n\n(Please note that your Netflix and YouTube accounts will be used to log in. Ensure you log out before checking out to protect your account from unauthorized use.)\n\nSTAFF AND SERVICES INCLUDED\n- Dedicated Villa Manager\n- Villa Host (Ubud) or Staff (Seminyak/Bukit)\n- Daily Housekeeping\n- Garden and Pool Staff\n\nEXTRA COSTS (advance notice may be required):\n- Villa pre-stocking: Groceries and beverages (subject to an additional service fee).\n- Breakfast by Villa Host (Ubud ONLY): IDR 120.000 per person per meal as a cover charge (minimum 4 guests).\n- Floating breakfast: IDR 150.000 per tray (for up to 4 guests).\n- In-villa Chef: Arranged through our trusted partner (see FAQs for details).\n- Airport transfers: Convenient pick-up and drop-off services.\n- Driving service: Reliable and professional drivers available on request.\n- Activities and excursions: Customized experiences to explore Bali.\n- In-villa massage services: Relax and rejuvenate in your villa's comfort.\n- Baby-sitting service: Experienced caretakers for your little ones.\n- Security guards: Additional safety and peace of mind.\n- Flowers arrangements: Custom designs to enhance your stay.\n\nGuest access\nRoad Access: Many villas have narrow road access, often suitable for motorcycles only. We can assist with transportation arrangements if needed.\n\nOther things to note\nIf Nearby Construction Occurs: We value your peaceful stay. In the rare event of construction in our area, our team is ready to assist with any comfort concerns. While neighborhood activities are beyond our control, your relaxation remains our priority. Please don't hesitate to contact us if you need anything to enhance your experience.\n\nNatural Ventilation: Experience the refreshing breeze of Bali with our open-air living spaces, designed to maximize natural airflow, providing an eco-friendly alternative to air conditioning or fans.\n\nVendor Services: To ensure the villa's equipment and your safety, our dedicated team manages all vendor services within the villa, including spa, personal training, decorations, private chefs, yoga, photography, and villa equipment. Using external vendors is strictly prohibited and will result in a fine of IDR 2.000.000.\n\nWaste Management: Contribute to Bali's sustainable efforts by participating in our waste separation program. We provide three bins for organic, inorganic, and residual waste in your villa.\n\nEco-Conscious Amenities: We provide Sensatia Botanicals, a locally founded skincare brand, as bathroom amenities (hand soap, body soap, shampoo, and conditioner). Made in Bali with 100% natural, cruelty-free ingredients, this partnership reflects our support for sustainability and local initiatives, including plastic recycling and beach cleanups.\n\nNatural Charm: Our villas embrace Bali's tropical beauty, where the sounds of nature—geckos and insects—create a serene ambiance. The open design may occasionally welcome wildlife, despite regular pest control. Geckos, symbols of good luck in Balinese culture, and other creatures are vital to the ecosystem.  \n\nCultural Respect: In Ubud and Bukit, monkeys may be present—please refrain from feeding or interacting with them. Surrounding landscapes, like jungles, rice fields, and local farms (e.g., duck, chicken or pig), are not part of the villa property and may be accessed by residents, with changes beyond our control. We appreciate your respect for Bali’s natural and cultural heritage.\n\nFAQs\n\nQ: What time is the check-in policy?\nA: Our dedicated staff ensures a smooth check-in process. Check-in starts at 14:00 for 1-3 bedroom villas and at 15:00 for 4-6 bedroom villas. Luggage drop-off is welcome after 11:00 as we prepare your villa. Please note, a late check-in fee of IDR 200.000 applies for arrivals after 20:00 to cover staff overtime, as our staff does not stand by the villa all the time.\n\nQ: What time is the check-out policy?\nA: Our check-out time is at 11:00 by default. Late check-out is subject to availability and involves extra charge. Please note that for any late check-out between 11:00 – 18:00, an additional charge of 50% of the Daily Villa Rate will apply. Any check-out after 18:00, will be charged at a full day's Daily Villa Rate. If you need to store your luggage after check-out time, you are welcome to do so.\n\nQ: Is breakfast included in the booking? How do we order the chef's service?\nA: Breakfast is not included in the room rate. However, you can easily arrange breakfast by contacting our reservation or concierge team. We offer a variety of menu options prepared by our dedicated private chef, right in your villa. The cost is IDR 160.000 per person, with a minimum order for 5 guests. You can indulge in a floating breakfast for an additional fee of IDR 150.000 per tray.\n\nFor lunch and dinner, we offer enhanced services, including set menus, live BBQ cooking, ethnic cuisines, and even fine dining prepared by a Michelin-star chef, all cooked in the villa. Prices for lunch and dinner start at IDR 450.000 per person. Please note that terms and conditions apply for booking.\n\nAdditionally, our villa features a fully equipped kitchen, allowing you the flexibility to prepare your own meals if you prefer. Whether you choose to dine in or savor a chef’s touch, our team is here to ensure a seamless and enjoyable experience.\n\nQ: Do we have a housekeeping service every day?\nA: Absolutely! Daily housekeeping is provided from 9:00 to 17:00. Linens are changed every third day for sustainability. To ensure privacy, please coordinate with your Villa Host or Staff for a convenient cleaning time. Your comfort is our priority.\n\nQ: Can we have extra clean towels?\nA: Certainly! We are happy to provide extra towels, subject to availability. Please feel free to reach out to your Villa Host or Staff, and we’ll do our best to accommodate your request promptly.\n\nQ: What is the maximum occupancy for this 3-bedroom villa? Can I have extra beds?\nA: This villa comfortably accommodates up to 6 guests. However, it can host a maximum of 8 guests, with the 7th and 8th guests considered as extra. An additional fee of IDR 365.000/night/person applies. Should you require extra beds, please feel free to let us know, and we’ll be happy to assist in making arrangements for your group’s comfort.",
  "capacity": "12 guests  -  6 bedrooms  -  6 beds  -  6 baths",
  "location": "Entire villa in Ubud, Indonesia",
  "amenitiesByCategory": {
    "Bathroom": [
      "Bathtub",
      "Outdoor shower"
    ],
    "Entertainment": [
      "TV",
      "Exercise equipment"
    ],
    "Heating and cooling": [
      "Air conditioning",
      "Indoor fireplace"
    ],
    "Home safety": [
      "Exterior security cameras on property"
    ],
    "Internet and office": [
      "Wifi",
      "Dedicated workspace"
    ],
    "Kitchen and dining": [
      "Kitchen",
      "Microwave",
      "Cooking basics",
      "Stainless steel oven"
    ],
    "Location features": [
      "Private entrance"
    ],
    "Outdoor": [
      "Private backyard – Not fully fenced",
      "Outdoor dining area"
    ],
    "Parking and facilities": [
      "Free parking on premises",
      "Private outdoor pool - available all year, open 24 hours, infinity",
      "Private gym in building"
    ],
    "Services": [
      "Luggage dropoff allowed",
      "Long term stays allowed",
      "Self check-in",
      "Cleaning available during stay"
    ]
  },
  "badges": [
    "superhost",
    "guest_favorite"
  ],
  "reviews": [
    {
      "reviewer": "Anacia",
      "text": "The host was amazing and was always responsive. Villa was well kept with daily house keeping. Booked in Villa massage and daily driver which was amazing. Construction next door, however, not disruptive at all. Needs more lights walking up to Villa because it gets very dark at night and we had to use our phone flash lights. Overall, I would recommend and book again."
    },
    {
      "reviewer": "Sahil",
      "text": "Stayed at this pristine property with a group of friends for 3 nights and it met almost every expectation we had with it. \nlocated 10 mins from the busy Ubud market, the property is really well maintained with all the essential one must need from kitchen to bedroom. \nMr. Surya ensured flexible check in and ensured hassle free stay at the villa. The cleaning staff was also very professional and made sure the property was smacking clean everytime we returned home in the evening. \nhave no complaints and hesitation to recommend this property to everyone."
    },
    {
      "reviewer": "Ronja",
      "text": "This was really great experience. Everything we needed they were there. The staff were super helpful and always wanted to please. We would return this villa whenever. We have had a great time. We want to say thank you so much to the villa manager."
    },
    {
      "reviewer": "Gavin",
      "text": "Had a great stay here with a group of 12—the location is solid (just some construction nearby), but the host was very responsive and helpful with planning activities. Villa itself is beautiful with all necessary amenities, and the pool was amazing as well."
    },
    {
      "reviewer": "Angela",
      "text": "The staff is extremely helpful and accommodating. This is a great place to stay and entertain"
    },
    {
      "reviewer": "Neoma",
      "text": "Villa Baia was magical. What a dreamy place. With some reviews it was abit hesitant but I’m glad I didn’t listen. Yes the road can be narrow for drivers but the walk to the road is really easy and bikes have easy access to get there. I found the construction not noisy at all and was really decent. The service was amazing , surya and his team were exceptional and so helpful when we needed them. From booking massages to them organising a surprise for my 30th witj my friends.I was truly blown away and had the best birthday ever.  The rooms were amazing and fit the 12 of us, if you need single beds they changed it super easily from the double. Was really good for my big group. The pool was so nice, and if you wanted to do yoga mats were provided.\nThey even help with my washing taking it to the local laundry and bringing it back. They were super responsive and helpful, my group had the best time and we enjoyed our stay a lot. 11/10"
    },
    {
      "reviewer": "Maria Cristina",
      "text": "What a wonderful stay at Villa Baia! You will love it! The villa was gorgeous!!! Set in the middle of rice fields - we truly felt that Ubud charm! Villa was more than enough for our family of 9. Billiards, swimming pool, in home chef, floating breakfast, in home massages, outstanding host — everything you need for a relaxing, fun filled and memorable vacation!!!! Short walk from main road but we believe once construction is done - vehicle can easily drop you off and pick up from gate - already looking forward to when we can come back with family. Our host Mr Surya and his staff were absolutely outstanding! From our requests for things we needed (water, coffee etc) to their daily housekeeping - everything was extremely well taken care of!!! Excellent communication! Mr Surya and his staff truly  an asset to Bali superhost and we won’t hesitate booking with Bali superhost in the future as well as we will recommend to all our family and friends!!!! Thank you Bali and til we meet again!"
    },
    {
      "reviewer": "Amos",
      "text": "Staff were super friendly and helpful"
    },
    {
      "reviewer": "Tiara",
      "text": "This Villa was beyond amazing. We had such an amazing time and the host was super responsive and accommodating . I would recommended this villa and I would stay here."
    },
    {
      "reviewer": "Nicole",
      "text": "Amazing villa even better than the description staff were very responsive and friendly overall a great stay 🙏🏽"
    },
    {
      "reviewer": "Thongtxi",
      "text": "Beautiful Villa for a big family gathering and enjoying vacation."
    },
    {
      "reviewer": "Tom",
      "text": "Such an epic Villa! Our guests were all speechless when they walked in. For the money you get not just a Villa but a 5* experience with breathtaking space, location and features!\nA few road issues as we expected from reading the other reviews however it’s understandable as they are just making the villas more easily accessible for the future. Any issues we had we messaged our host and he went and spoke to the workers to ensured important times of the day the road was clear to get cars up and back\nIf you book you won’t be disappointed"
    },
    {
      "reviewer": "Allora",
      "text": "We moved out stay.\nThe accommodation was stunning with picture perfect views. It was quiet and just off the beaten track that we enjoyed the serenity but were able to walk to the local shops and main strip of ubud. Our host was fantastic and always responsive. We would come back at any time"
    },
    {
      "reviewer": "Carmisha",
      "text": "Our entire stay was awesome! The host, the Airbnb staff etc were all so nice and accommodating. Whatever I asked for I got with no hesitation, even a last minute bouquet of flowers I requested to have within a few hours. I don’t think I have ever stayed somewhere and the hospitality was this phenomenal. The photos honestly don’t do enough because the place is simply breathtaking in person. Thank you all so much for making my birthday trip amazing!"
    },
    {
      "reviewer": "Angela",
      "text": "Beautiful home just like the pictures. Great location to explore Ubud. The staff and all services were top notch from host Yoga, to staff chef prepared meals, transportation, flower decor and photography exceeded our expectations. Would definitely recommend this villa for groups. We would definitely visit and stay at this villa again anytime. Thank you to the host and ask the staff for making our group of 14 ladies feel welcomed and relaxed for a phenomenal vacation. Until next time."
    },
    {
      "reviewer": "Andreas",
      "text": "Great mega mansion that leaves nothing to be desired, extremely friendly staff, everything perfect. Great for business events or relaxing with friends/family"
    },
    {
      "reviewer": "Amber",
      "text": "We had a fantastic stay at this villa! It was perfect for our family. The villa was beautiful and the staff were lovely! Would stay agian!"
    },
    {
      "reviewer": "Stanzie",
      "text": "Really loved this villa despite some communication problems. I had requested two beds per room and arrived to find only 1 room that had 2 beds. The on- site manager was reluctant to fix it, and acted as if there were no linens. However, they had all the linens right there in the storage. Thankfully my Balinese friend was able to tell him to make it right.\n Also, I had requested to move the pool table which the manager also refused to do on arrival even though they said it was fine on airbnb. Clearly, there's poor communication between the Airbnb manager and the property manager. It led to a lot of stress on arrival. Once we worked that out, everything was really great at the villa. I would like to come back again next year as long as the communication can be better... and they can deliver what they promised.\nPool was nice, rooms were great, location was quiet and a short drive to town."
    }
  ],
  "images": [
    {
      "src": "https://a0.muscache.com/im/pictures/prohost-api/Hosting-827063432874808180/original/1086dc35-2ded-41de-bbd6-12363b932817.jpeg?im_w=720",
      "alt": "Living room image 1",
      "width": 741,
      "height": 497,
      "aspect": "landscape",
      "category": "Living room"
    },
    {
      "src": "https://a0.muscache.com/im/pictures/prohost-api/Hosting-827063432874808180/original/3cad6a5e-3de0-43f6-aee2-bbda189c3de6.jpeg?im_w=720",
      "alt": "Living room image 2",
      "width": 367,
      "height": 246,
      "aspect": "landscape",
      "category": "Living room"
    },
    {
      "src": "https://a0.muscache.com/im/pictures/prohost-api/Hosting-827063432874808180/original/ba118203-3b26-442b-9185-b2d45a3723e4.jpeg?im_w=720",
      "alt": "Full kitchen image 1",
      "width": 741,
      "height": 497,
      "aspect": "landscape",
      "category": "Full kitchen"
    },
    {
      "src": "https://a0.muscache.com/im/pictures/prohost-api/Hosting-827063432874808180/original/dc56b9d2-e7ce-4ecf-9769-7cb0133de1bf.jpeg?im_w=720",
      "alt": "Dining area 1 image 1",
      "width": 367,
      "height": 246,
      "aspect": "landscape",
      "category": "Dining area 1",
      "mustUse": true
    },
    {
      "src": "https://a0.muscache.com/im/pictures/prohost-api/Hosting-827063432874808180/original/129c1681-310f-4767-8774-ba7b7e63f9ac.jpeg?im_w=720",
      "alt": "Dining area 1 image 2",
      "width": 367,
      "height": 246,
      "aspect": "landscape",
      "category": "Dining area 1"
    },
    {
      "src": "https://a0.muscache.com/im/pictures/prohost-api/Hosting-827063432874808180/original/5f58a74f-0894-474b-a4f6-897c07670b5f.jpeg?im_w=720",
      "alt": "Dining area 2 image 1",
      "width": 741,
      "height": 497,
      "aspect": "landscape",
      "category": "Dining area 2"
    },
    {
      "src": "https://a0.muscache.com/im/pictures/prohost-api/Hosting-827063432874808180/original/1aa51871-3149-4e28-9a47-34101f337a2f.jpeg?im_w=720",
      "alt": "Bedroom 1 image 1",
      "width": 367,
      "height": 246,
      "aspect": "landscape",
      "category": "Bedroom 1",
      "mustUse": true
    },
    {
      "src": "https://a0.muscache.com/im/pictures/prohost-api/Hosting-827063432874808180/original/2301f33f-460e-4788-b0a6-350d05e94d01.jpeg?im_w=720",
      "alt": "Bedroom 1 image 2",
      "width": 367,
      "height": 246,
      "aspect": "landscape",
      "category": "Bedroom 1"
    },
    {
      "src": "https://a0.muscache.com/im/pictures/prohost-api/Hosting-827063432874808180/original/1c7f8cb3-347a-45aa-9a38-e5640bade0cb.jpeg?im_w=720",
      "alt": "Bedroom 2 image 1",
      "width": 367,
      "height": 246,
      "aspect": "landscape",
      "category": "Bedroom 2",
      "mustUse": true
    },
    {
      "src": "https://a0.muscache.com/im/pictures/prohost-api/Hosting-827063432874808180/original/f81233e9-4fb2-41ff-94bc-daa63dcccc81.jpeg?im_w=720",
      "alt": "Bedroom 2 image 2",
      "width": 367,
      "height": 246,
      "aspect": "landscape",
      "category": "Bedroom 2"
    },
    {
      "src": "https://a0.muscache.com/im/pictures/prohost-api/Hosting-827063432874808180/original/7c08d256-89db-400d-bc3a-ed207bbf8301.jpeg?im_w=720",
      "alt": "Bedroom 3 image 1",
      "width": 741,
      "height": 497,
      "aspect": "landscape",
      "category": "Bedroom 3",
      "mustUse": true
    },
    {
      "src": "https://a0.muscache.com/im/pictures/prohost-api/Hosting-827063432874808180/original/bdd230ad-213a-43ea-ac1b-2d985a5ade9d.jpeg?im_w=720",
      "alt": "Bedroom 4 image 1",
      "width": 741,
      "height": 497,
      "aspect": "landscape",
      "category": "Bedroom 4",
      "mustUse": true
    },
    {
      "src": "https://a0.muscache.com/im/pictures/prohost-api/Hosting-827063432874808180/original/711b35ad-2185-4b96-8841-53db3bbca856.jpeg?im_w=720",
      "alt": "Bedroom 5 image 1",
      "width": 741,
      "height": 497,
      "aspect": "landscape",
      "category": "Bedroom 5",
      "mustUse": true
    },
    {
      "src": "https://a0.muscache.com/im/pictures/prohost-api/Hosting-827063432874808180/original/cddaa717-c033-40e8-9de4-b9fee7a75902.jpeg?im_w=720",
      "alt": "Bedroom 6 image 1",
      "width": 741,
      "height": 497,
      "aspect": "landscape",
      "category": "Bedroom 6",
      "mustUse": true
    },
    {
      "src": "https://a0.muscache.com/im/pictures/prohost-api/Hosting-827063432874808180/original/f653df9f-0b89-4182-910d-6c3ab58427c3.jpeg?im_w=720",
      "alt": "Full bathroom image 1",
      "width": 741,
      "height": 497,
      "aspect": "landscape",
      "category": "Full bathroom"
    },
    {
      "src": "https://a0.muscache.com/im/pictures/prohost-api/Hosting-827063432874808180/original/14e96892-aaa2-4383-86f4-db17fd750f3f.jpeg?im_w=720",
      "alt": "Full bathroom image 2",
      "width": 367,
      "height": 246,
      "aspect": "landscape",
      "category": "Full bathroom"
    },
    {
      "src": "https://a0.muscache.com/im/pictures/prohost-api/Hosting-827063432874808180/original/cae97244-aeb7-41ab-81fb-d686978e915d.jpeg?im_w=720",
      "alt": "Full bathroom image 3",
      "width": 367,
      "height": 246,
      "aspect": "landscape",
      "category": "Full bathroom"
    },
    {
      "src": "https://a0.muscache.com/im/pictures/prohost-api/Hosting-827063432874808180/original/43be2157-897c-4a24-9885-38df4a183452.jpeg?im_w=720",
      "alt": "Gym image 1",
      "width": 741,
      "height": 497,
      "aspect": "landscape",
      "category": "Gym"
    },
    {
      "src": "https://a0.muscache.com/im/pictures/prohost-api/Hosting-827063432874808180/original/02ca9484-f032-4c79-8754-26a562ac9b98.jpeg?im_w=1920",
      "alt": "Exterior image 1",
      "width": 741,
      "height": 497,
      "aspect": "landscape",
      "category": "Exterior",
      "isHero": true,
      "mustUse": true
    },
    {
      "src": "https://a0.muscache.com/im/pictures/prohost-api/Hosting-827063432874808180/original/788cd35e-fdf0-4c34-ac9b-555c91b6908e.jpeg?im_w=720",
      "alt": "Exterior image 2",
      "width": 367,
      "height": 246,
      "aspect": "landscape",
      "category": "Exterior"
    },
    {
      "src": "https://a0.muscache.com/im/pictures/prohost-api/Hosting-827063432874808180/original/0ba315c3-a3b7-4b34-8456-9153a9819487.jpeg?im_w=720",
      "alt": "Exterior image 3",
      "width": 367,
      "height": 246,
      "aspect": "landscape",
      "category": "Exterior"
    },
    {
      "src": "https://a0.muscache.com/im/pictures/prohost-api/Hosting-827063432874808180/original/978466e6-b824-445e-a492-f16339d5a195.jpeg?im_w=720",
      "alt": "Exterior image 4",
      "width": 741,
      "height": 497,
      "aspect": "landscape",
      "category": "Exterior"
    },
    {
      "src": "https://a0.muscache.com/im/pictures/prohost-api/Hosting-827063432874808180/original/ac626a20-50a6-4204-8315-052b1595823d.jpeg?im_w=720",
      "alt": "Exterior image 5",
      "width": 367,
      "height": 246,
      "aspect": "landscape",
      "category": "Exterior"
    },
    {
      "src": "https://a0.muscache.com/im/pictures/prohost-api/Hosting-827063432874808180/original/dce359e7-f116-4fa1-b6b6-76633270407b.jpeg?im_w=720",
      "alt": "Exterior image 6",
      "width": 367,
      "height": 246,
      "aspect": "landscape",
      "category": "Exterior"
    },
    {
      "src": "https://a0.muscache.com/im/pictures/prohost-api/Hosting-827063432874808180/original/3423cc15-9724-4038-a692-4e9e941bb3b4.jpeg?im_w=720",
      "alt": "Exterior image 7",
      "width": 367,
      "height": 246,
      "aspect": "landscape",
      "category": "Exterior"
    },
    {
      "src": "https://a0.muscache.com/im/pictures/prohost-api/Hosting-827063432874808180/original/cafa1a1a-50b5-41ee-8561-137a6f1966b5.jpeg?im_w=720",
      "alt": "Pool image 1",
      "width": 741,
      "height": 497,
      "aspect": "landscape",
      "category": "Pool",
      "mustUse": true
    },
    {
      "src": "https://a0.muscache.com/im/pictures/prohost-api/Hosting-827063432874808180/original/1ded0f6e-9e1d-4a73-b84e-1d9890dd17e7.jpeg?im_w=720",
      "alt": "Pool image 2",
      "width": 367,
      "height": 246,
      "aspect": "landscape",
      "category": "Pool"
    },
    {
      "src": "https://a0.muscache.com/im/pictures/prohost-api/Hosting-827063432874808180/original/ad9a5318-fd7f-41fc-b8ba-a98708777853.jpeg?im_w=720",
      "alt": "Pool image 3",
      "width": 367,
      "height": 246,
      "aspect": "landscape",
      "category": "Pool"
    },
    {
      "src": "https://a0.muscache.com/im/pictures/prohost-api/Hosting-827063432874808180/original/d17b2be5-175f-4ad9-bfe3-4837d54b9b3a.jpeg?im_w=720",
      "alt": "Pool image 4",
      "width": 741,
      "height": 497,
      "aspect": "landscape",
      "category": "Pool"
    },
    {
      "src": "https://a0.muscache.com/im/pictures/prohost-api/Hosting-827063432874808180/original/e03cc019-67f6-4c1c-bab1-16c581610479.jpeg?im_w=720",
      "alt": "Pool image 5",
      "width": 367,
      "height": 246,
      "aspect": "landscape",
      "category": "Pool"
    },
    {
      "src": "https://a0.muscache.com/im/pictures/prohost-api/Hosting-827063432874808180/original/ebe45b87-cbdc-45b7-80fb-ff1c11501232.jpeg?im_w=720",
      "alt": "Game room image 1",
      "width": 741,
      "height": 497,
      "aspect": "landscape",
      "category": "Game room"
    }
  ],
  "highlights": [
    {
      "title": "Swim in the infinity pool",
      "description": "It's one of the many things that makes this home special."
    },
    {
      "title": "Self check-in",
      "description": "You can check in with the building staff."
    },
    {
      "title": "At-home coffee",
      "description": "Start your morning right with the pour-over coffee maker."
    }
  ]
}