{
  "id": "1245570220521334980",
  "url": "https://www.airbnb.com/rooms/1245570220521334980",
  "title": "Villa LYLA - Private Villa 10 min Walk to Beach",
  "summary": "Lyla COCOON Nelayan Villa offers an exclusive and relaxing escape in the vibrant heart of Canggu. Our villa is just 5 min to the beach, world-class surf spots, and and walking distance to Bali's best restaurants and cafes, providing the perfect blend of relaxation and adventure. The villa is thoughtfully designed with modern amenities,  for your convenience. Enjoy high-speed WiFi (up to 100mbps), daily cleaning service, and on-site security every night, ensuring a seamless and worry-free stay.\n\nThe space\nTRANQUILITY, BEACHES &amp; BALINESE CULTURE  \nFor those seeking a peaceful retreat away from the busy tourist hubs, yet still close to the excitement, this place is ideal for you. Nestled in a quiet neighborhood just inland from Canggu’s Nelayan, our property is only a 5 minutes away to the beach, offering a perfect blend of serenity and accessibility. \n\nTHE POOL &amp; GARDEN  \nRelax and recharge in our refreshing plunge pool, set amidst a lush tropical garden. It’s the perfect spot to unwind and enjoy the peaceful atmosphere.\n\nTHE BEDROOM &amp; BATHROOM  \nThe bedroom features a custom-made king-size bed (1.8x2m) with direct access to the plunge pool and stunning views of the garden. \n\nThe bathroom, accessible through a sliding door beside the wardrobe, boasts a beige herringbone floor and a terrazzo shower overlooking a private tropical garden. The sink area is enhanced by a marble backsplash and illuminated by modern pendant lights, with a backlit mirror to brighten your mornings.\n\nTHE KITCHEN &amp; DINING  \nThe fully equipped kitchen includes everything you need (microwave, dishwasher, and more) to prepare delicious meals. Whether cooking a quiet dinner for two or preparing breakfast, you’ll have all the essentials.\n\nTHE LIVING ROOM  \nOur living room offers a cozy custom-made sofa, perfect for lounging. A smart TV is provided so you can log into your favorite streaming accounts, making it a great space to relax and catch up on your Netflix series.\n\nTHE TERRACE &amp; LOUNGE AREA  \nSoak up the sun on the terrace, featuring two stylish sun loungers, ideal for working on your tan or relaxing in the warm Bali breeze. In the evening, it’s the perfect spot for stargazing and enjoying the tranquil night sky.\n\nWe follow Airbnb's five-step cleaning process, ensuring a safe and sparkling environment for all our guests. This process was developed in partnership with leading experts to guarantee cleanliness and comfort throughout your stay.\n\nGuest access\nDuring your stay, you’ll have the entire villa to yourself. Enjoy complete privacy and make yourself at home — whether you’re relaxing by the pool, lounging in the living spaces, or making use of the modern amenities. This is your exclusive escape to unwind and enjoy everything Canggu has to offer!\n\nOther things to note\nNestled in the tranquil Nelayan area, our villa is just 5 minutes away to the beach, world-class surf spots, and and walking distance to Bali's best restaurants and cafes, providing the perfect blend of relaxation and adventure. The villa is thoughtfully designed with modern amenities, including a fully equipped kitchen with a water dispenser, microwave, fridge, and dishwasher, plus a dedicated laundry room with a washing machine for your convenience. Enjoy high-speed WiFi (up to 100mbps), daily cleaning service, and on-site security every night, ensuring a seamless and worry-free stay. Experience the ultimate Bali getaway at Lyla COCOON Nelayan Villa, where comfort meets luxury in a stunning setting.",
  "capacity": "2 guests  -  1 bedroom  -  1 bed  -  1 bath",
  "location": "Entire home in Kecamatan Kuta Utara, Indonesia",
  "amenitiesByCategory": {
    "Bedroom and laundry": [
      "Washer",
      "Safe"
    ],
    "Entertainment": [
      "TV"
    ],
    "Heating and cooling": [
      "Air conditioning"
    ],
    "Internet and office": [
      "Wifi"
    ],
    "Kitchen and dining": [
      "Kitchen",
      "Microwave",
      "Cooking basics",
      "Dishwasher",
      "Dining table"
    ],
    "Outdoor": [
      "Sun loungers"
    ],
    "Parking and facilities": [
      "Free street parking",
      "Pool"
    ],
    "Services": [
      "Self check-in",
      "Lockbox",
      "Cleaning available during stay"
    ]
  },
  "badges": [
    "superhost",
    "guest_favorite"
  ],
  "reviews": [
    {
      "reviewer": "Rhonda",
      "text": "The villa was beautiful and clean. It was very near the beach to walk to and close to amazing restaurants. The villa had everything we needed. \nGregory was responsive and helpful. Ensure you tell your driver to put in the sat nav Tiga restaurant and then you can walk across the street to the villa down a pathway where you see a blue sign that says Eva suites and stay to the left then follow the directions Gregory sends to you. You will love it! Our driver Ainun is the best driver in Canggu."
    },
    {
      "reviewer": "Jessica",
      "text": "Highly recommended!! \nThe house is a little tucked away from the main road, which we actually loved, it made for a very peaceful and quiet stay, a real bonus considering how lively and sometimes noisy Canggu can get. \nThe home itself is absolutely beautiful, tastefully designed, and very comfortable, we felt right at home the moment we arrived. \nThere are also plenty of great cafes and restaurants just a short walk away.\nWould definitely stay here again!"
    },
    {
      "reviewer": "Jason",
      "text": "Awesome villa and host! Greg was very responsive and accommodating with our needs. \nThis villa is gorgeous! Very cute lilttle touches to enlighten us during our stay, like the pajamas, the diffuser, the guestbook etc..\nLocation is unbeatable, close to everything, yet private and quiet enough, despite of some construction that's been going on just like everywhere else now in bali...\nwe loved every minute of it!"
    },
    {
      "reviewer": "Siwen",
      "text": "The path to get into the house has a great feeling.The design of the house is amazing, the movement line is particularly smooth, the space is very high, it is very high. At night, the music is very good. The lights and walls are also very textured... The house is fully equipped, and the host has a heart.The location is good, just a lively street out.Absolutely loved it, recommended."
    },
    {
      "reviewer": "Yousef",
      "text": "The place is very nice and elegant and all the details are very sweet. The furniture is clean and new. The place is arranged to the farthest side of the street. All you need. There are coffee shops, restaurants and shops. The place is very wonderful. The location connects you to the house, but enter the car, it is difficult for the narrow entrance, but go back and re-visit the place"
    },
    {
      "reviewer": "Marvin",
      "text": "The villa is  a little oasis in the heart of Canggu. Location is excellent 1minute walk to best cafes and restaurants in Jl.Neyalan. And 5 minutes walking distance to the beach. Every part of the villa is spotless clean and beautiful decorated. We definitely will come back and recommend this villa. Gregory and staff is very kind and responsive."
    },
    {
      "reviewer": "Ashton",
      "text": "Gregory was super easy to communicate with and super friendly. We had the power go out one morning I let him know straight away he had someone there looking at it. within 4 hours the problem was fixed. Was not a small fix but he was onto it straight away. Place was spotless no complaints enjoyed my stay"
    },
    {
      "reviewer": "Chloe",
      "text": "Villa Lyla was fantastic. We loved our stay, it was very central but set back off the road so was very quiet (even with construction going on next door) and felt very safe. Would recommend and would stay there again!"
    },
    {
      "reviewer": "Celal Mert",
      "text": "The house was perfect. At the same time, it was in a very good location, close to everywhere. I thank our host very much, he was very interested. Thanks for everything"
    },
    {
      "reviewer": "Shannon",
      "text": "Wonderful stay the villa was perfect, great location, we will definitely be back!"
    },
    {
      "reviewer": "Rob",
      "text": "Fantastic villa. Great central location in Canggu. Would go back."
    },
    {
      "reviewer": "Jorell",
      "text": "Crazy! It was absolutely perfect! Also the location is perfect!!!"
    },
    {
      "reviewer": "Monirul",
      "text": "Had an amazing time. Easy to communicate. Great host"
    },
    {
      "reviewer": "Taylar",
      "text": "Was a beautiful stay and so close to the beach"
    },
    {
      "reviewer": "Nick",
      "text": "Great villa. Highly recommend. Good location."
    },
    {
      "reviewer": "Natasha",
      "text": "Very happy with our stay! Would stay again"
    },
    {
      "reviewer": "Dasha",
      "text": "Great experience, the villa is very nice"
    },
    {
      "reviewer": "Sophie",
      "text": "I recommend this place!"
    }
  ],
  "images": [
    {
      "src": "https://a0.muscache.com/im/pictures/miso/Hosting-1245570220521334980/original/54df1f5d-8ac9-4530-9c72-dea06433caf4.jpeg?im_w=720",
      "alt": "Living room image 1",
      "width": 367,
      "height": 499,
      "aspect": "portrait",
      "category": "Living room",
      "mustUse": true
    },
    {
      "src": "https://a0.muscache.com/im/pictures/miso/Hosting-1245570220521334980/original/5ffa7aee-aa3e-4ecd-ad75-c1e9e2c26f86.jpeg?im_w=720",
      "alt": "Living room image 2",
      "width": 367,
      "height": 246,
      "aspect": "landscape",
      "category": "Living room"
    },
    {
      "src": "https://a0.muscache.com/im/pictures/miso/Hosting-1245570220521334980/original/5b298ef8-39bb-480e-a94b-015999c976fe.jpeg?im_w=720",
      "alt": "Living room image 3",
      "width": 367,
      "height": 246,
      "aspect": "landscape",
      "category": "Living room"
    },
    {
      "src": "https://a0.muscache.com/im/pictures/miso/Hosting-1245570220521334980/original/a5bae482-ed7a-4589-848a-0711f44ea71c.jpeg?im_w=720",
      "alt": "Living room image 4",
      "width": 367,
      "height": 246,
      "aspect": "landscape",
      "category": "Living room"
    },
    {
      "src": "https://a0.muscache.com/im/pictures/miso/Hosting-1245570220521334980/original/ab02ea26-77e8-4851-bd27-3710ec202d13.jpeg?im_w=720",
      "alt": "Living room image 5",
      "width": 367,
      "height": 246,
      "aspect": "landscape",
      "category": "Living room"
    },
    {
      "src": "https://a0.muscache.com/im/pictures/miso/Hosting-1245570220521334980/original/faa2a240-8264-4305-95ab-71087397b777.jpeg?im_w=720",
      "alt": "Full kitchen image 1",
      "width": 741,
      "height": 497,
      "aspect": "landscape",
      "category": "Full kitchen"
    },
    {
      "src": "https://a0.muscache.com/im/pictures/miso/Hosting-1245570220521334980/original/e2bff4e3-f0ba-4079-916b-8c6897ccb091.jpeg?im_w=720",
      "alt": "Dining area image 2",
      "width": 242,
      "height": 329,
      "aspect": "portrait",
      "category": "Dining area"
    },
    {
      "src": "https://a0.muscache.com/im/pictures/miso/Hosting-1245570220521334980/original/c4c2db15-2443-4d54-b368-78b95f14253a.jpeg?im_w=720",
      "alt": "Dining area image 1",
      "width": 492,
      "height": 329,
      "aspect": "landscape",
      "category": "Dining area"
    },
    {
      "src": "https://a0.muscache.com/im/pictures/miso/Hosting-1245570220521334980/original/a8721ca7-f370-4b16-8ae8-2eccde70c0c9.jpeg?im_w=1920",
      "alt": "Bedroom image 1",
      "width": 367,
      "height": 246,
      "aspect": "landscape",
      "category": "Bedroom",
      "isHero": true,
      "mustUse": true
    },
    {
      "src": "https://a0.muscache.com/im/pictures/miso/Hosting-1245570220521334980/original/fdc6572b-0d5c-4bd7-81cc-ebddca264132.jpeg?im_w=720",
      "alt": "Bedroom image 2",
      "width": 367,
      "height": 246,
      "aspect": "landscape",
      "category": "Bedroom",
      "mustUse": true
    },
    {
      "src": "https://a0.muscache.com/im/pictures/miso/Hosting-1245570220521334980/original/6c8884d4-2abf-4a0a-8a97-64d038749f21.jpeg?im_w=720",
      "alt": "Full bathroom image 2",
      "width": 242,
      "height": 329,
      "aspect": "portrait",
      "category": "Full bathroom"
    },
    {
      "src": "https://a0.muscache.com/im/pictures/miso/Hosting-1245570220521334980/original/6b8c65e5-72a1-441e-b466-b3317480fcf9.jpeg?im_w=720",
      "alt": "Full bathroom image 1",
      "width": 492,
      "height": 329,
      "aspect": "landscape",
      "category": "Full bathroom",
      "mustUse": true
    },
    {
      "src": "https://a0.muscache.com/im/pictures/miso/Hosting-1245570220521334980/original/1bb9153f-511f-4116-a68a-aad4a325f840.jpeg?im_w=720",
      "alt": "Laundry area image 1",
      "width": 741,
      "height": 497,
      "aspect": "landscape",
      "category": "Laundry area"
    },
    {
      "src": "https://a0.muscache.com/im/pictures/miso/Hosting-1245570220521334980/original/fd011947-96ca-479d-82c2-6f2827ae8188.jpeg?im_w=720",
      "alt": "Pool image 2",
      "width": 242,
      "height": 329,
      "aspect": "portrait",
      "category": "Pool"
    },
    {
      "src": "https://a0.muscache.com/im/pictures/miso/Hosting-1245570220521334980/original/ff6365ad-3b52-4b81-abf8-d8d7633735a3.jpeg?im_w=720",
      "alt": "Pool image 1",
      "width": 492,
      "height": 329,
      "aspect": "landscape",
      "category": "Pool"
    },
    {
      "src": "https://a0.muscache.com/im/pictures/miso/Hosting-1245570220521334980/original/a1274a9a-3a5b-4b25-b782-40e318cbc95c.jpeg?im_w=720",
      "alt": "Additional photos image 1",
      "width": 741,
      "height": 497,
      "aspect": "landscape",
      "category": "Additional photos"
    },
    {
      "src": "https://a0.muscache.com/im/pictures/miso/Hosting-1245570220521334980/original/5af3ccf6-d01e-45e2-acff-179044ec263d.jpeg?im_w=720",
      "alt": "Additional photos image 2",
      "width": 492,
      "height": 654,
      "aspect": "portrait",
      "category": "Additional photos",
      "mustUse": true
    },
    {
      "src": "https://a0.muscache.com/im/pictures/miso/Hosting-1245570220521334980/original/8774415e-1173-4bc4-87ff-5aedbd7d1064.jpeg?im_w=720",
      "alt": "Additional photos image 3",
      "width": 242,
      "height": 323,
      "aspect": "portrait",
      "category": "Additional photos"
    }
  ],
  "highlights": [
    {
      "title": "Dive right in",
      "description": "This is one of the few places in the area with a pool."
    },
    {
      "title": "Self check-in",
      "description": "Check yourself in with the lockbox."
    },
    {
      "title": "Great restaurants nearby",
      "description": "Guests say there are excellent options for dining out."
    }
  ]
}